docs/research.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Felipe A. Ramírez</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="simple.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Felipe A. Ramírez</h1>
<p>
~ <a href="index.html">about</a> ~ <b>research</b> ~ <a href="teaching.html">teaching</a> ~ <a href="students.html">students</a> ~ <a href="cv.html">cv</a> ~ <a href="drp.html">drp</a> ~ <a href="nednt.html">nednt</a> ~
</p>


<p>
My research is in ergodic theory and dynamical systems, Diophantine
approximation, and fractal geometry. Most of my papers are on the
<a href="https://arxiv.org/a/ramirez_f_1.html">arxiv</a>. 
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">title</th>
<th scope="col" class="org-left">co-authors</th>
<th scope="col" class="org-left">journal</th>
<th scope="col" class="org-right">year</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Twisted approximation with restricted denominators</td>
<td class="org-left">M. Hauke</td>
<td class="org-left"><i>Submitted</i></td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Toward Khintchine's theorem with a moving target: extra divergence or finitely centered target</td>
<td class="org-left">G. Michaud</td>
<td class="org-left"><i>Mathematika</i></td>
<td class="org-right">2025</td>
</tr>

<tr>
<td class="org-left">General Duffin&#x2013;Schaeffer-type counterexamples in Diophantine approximation</td>
<td class="org-left">S. Chow, M. Hauke, A. Pollington</td>
<td class="org-left"><i>Mathematika</i>,  Special Wooley Issue</td>
<td class="org-right">to appear</td>
</tr>

<tr>
<td class="org-left">Metric bootstraps for limsup sets</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><i>Transactions of the American Mathematical Society</i></td>
<td class="org-right">2025</td>
</tr>

<tr>
<td class="org-left">The Duffin&#x2013;Schaeffer conjecture with a moving target</td>
<td class="org-left">M. Hauke</td>
<td class="org-left"><i>Submitted</i></td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Inhomogeneous approximation for systems of linear forms with primitivity constraints</td>
<td class="org-left">D. Allen</td>
<td class="org-left"><i>Mathematische Zeitschrift</i></td>
<td class="org-right">2025</td>
</tr>

<tr>
<td class="org-left">The Duffin&#x2013;Schaeffer conjecture for systems of linear forms</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><i>Journal of the London Mathematical Society</i></td>
<td class="org-right">2024</td>
</tr>

<tr>
<td class="org-left">Independence inheritance and Diophantine approximation for systems of linear forms</td>
<td class="org-left">D. Allen</td>
<td class="org-left"><i>International Mathematics Research Notices</i></td>
<td class="org-right">2023</td>
</tr>

<tr>
<td class="org-left">Diophantine approximation in metric space</td>
<td class="org-left">J. Fraser, H. Koivusalo</td>
<td class="org-left"><i>Bulletin of the London Mathematical Society</i></td>
<td class="org-right">2023</td>
</tr>

<tr>
<td class="org-left">Dirichlet is not just bad and singular</td>
<td class="org-left">V. Beresnevich, L. Guan, A. Marnat, S. Velani</td>
<td class="org-left"><i>Advances in Mathematics</i></td>
<td class="org-right">2022</td>
</tr>

<tr>
<td class="org-left">Remarks about inhomogeneous pair correlations</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><i>Mathematical Proceedings of the Cambridge Philosophical Society</i></td>
<td class="org-right">2022</td>
</tr>

<tr>
<td class="org-left">A note on sequences not having metric Poissonian pair correlations</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><i>Archiv der Mathematik</i></td>
<td class="org-right">2021</td>
</tr>

<tr>
<td class="org-left">Khintchine's theorem with random fractions</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><i>Mathematika</i></td>
<td class="org-right">2020</td>
</tr>

<tr>
<td class="org-left">A characterization of bad approximability</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><i>Nonlinearity</i></td>
<td class="org-right">2018</td>
</tr>

<tr>
<td class="org-left">Recurrence to shrinking targets on typical self-affine fractals</td>
<td class="org-left">H. Koivusalo</td>
<td class="org-left"><i>Proceedings of the Edinburgh Mathematical Society</i></td>
<td class="org-right">2018</td>
</tr>

<tr>
<td class="org-left">Rational approximation of affine coordinate subspaces of Euclidean space</td>
<td class="org-left">D. S. Simmons, F. Sueess</td>
<td class="org-left"><i>Acta Arithmetica</i></td>
<td class="org-right">2017</td>
</tr>

<tr>
<td class="org-left">Different speeds suffice for rendezvous of two agents in arbitrary graphs</td>
<td class="org-left">E. Kranakis, D. Krizanc, E. Markou, A. Pagourtzis</td>
<td class="org-left"><i>SOFSEM</i></td>
<td class="org-right">2017</td>
</tr>

<tr>
<td class="org-left">Counterexamples, covering systems, and zero-one laws for inhomogeneous approximation</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><i>International Journal of Number Theory</i></td>
<td class="org-right">2017</td>
</tr>

<tr>
<td class="org-left">Higher cohomology of parabolic actions on certain homogeneous spaces</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><i>Journal d'Analyse Mathematique</i></td>
<td class="org-right">2017</td>
</tr>

<tr>
<td class="org-left">Metric Diophantine Approximation: aspects of recent work</td>
<td class="org-left">V. Beresnevich, S. Velani</td>
<td class="org-left"><i>LMS Lecture Notes Series</i></td>
<td class="org-right">2016</td>
</tr>

<tr>
<td class="org-left">Khintchine types of translated coordinate hyperplanes</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><i>Acta Arithmetica</i></td>
<td class="org-right">2015</td>
</tr>

<tr>
<td class="org-left">Limit theorems for rank-one Lie groups</td>
<td class="org-left">A. Gorodnik</td>
<td class="org-left"><i>Proceedings of the American Mathematical Society</i></td>
<td class="org-right">2014</td>
</tr>

<tr>
<td class="org-left">Invariant distributions and cohomology for geodesic flows and higher cohomology of higher-rank Anosov actions</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><i>Journal of Functional Analysis</i></td>
<td class="org-right">2013</td>
</tr>

<tr>
<td class="org-left">Higher cohomology for Anosov actions on certain homogeneous spaces</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><i>Journal d'Analyse Mathematique</i></td>
<td class="org-right">2013</td>
</tr>

<tr>
<td class="org-left">Smooth cocycles over homogeneous dynamical systems</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Dissertation, University of Michigan</td>
<td class="org-right">2010</td>
</tr>

<tr>
<td class="org-left">Cocycles over higher-rank abelian actions on quotients of semisimple Lie groups</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><i>Journal of Modern Dynamics</i></td>
<td class="org-right">2009</td>
</tr>
</tbody>
</table>
</div>
</body>
</html>
